Dlubal.DynamPro.DynamicLoadCaseType
Type of dynamic load case

Dlubal.DynamPro.DynamicLoadCaseType.UnknownDLCMethodType
Unknown type

Dlubal.DynamPro.DynamicLoadCaseType.1
Unknown type

Dlubal.DynamPro.DynamicLoadCaseType.MultiModalAndMultiPointResponseSpectraAnalysis
Multi-modal and multi-point response spectrum analysis

Dlubal.DynamPro.DynamicLoadCaseType.TimeHistoryWithAccelerogramModalAnalysis
Modal Analysis (linear) (with accelerogram)

Dlubal.DynamPro.DynamicLoadCaseType.TimeHistoryWithAccelerogramLinearImplicit
Linear implicit Newmark solver (with accelerogram)

Dlubal.DynamPro.DynamicLoadCaseType.TimeHistoryWithAccelerogramNonlinearImpilicit
Nonlinear implicit Newmark solver (with accelerogram)

Dlubal.DynamPro.DynamicLoadCaseType.TimeHistoryAccelerogramExplicit
Explicit solver (with accelerogram)

Dlubal.DynamPro.DynamicLoadCaseType.TimeHistoryWithLoadTimeDiagramModalAnalysis
Modal Analysis (linear) (with load time diagram)

Dlubal.DynamPro.DynamicLoadCaseType.TimeHistoryWithLoadTimeDiagramLinearImplicit
Linear implicit Newmark solver (with load time diagram)

Dlubal.DynamPro.DynamicLoadCaseType.TimeHistoryWithLoadTimeDiagramNonlinearImplicit
Nonlinear implicit Newmark solver (with load time diagram)

Dlubal.DynamPro.DynamicLoadCaseType.TimeHistoryWithLoadTimeDiagramExplicit
Explicit solver (with load time diagram)

Dlubal.DynamPro.DynamicLoadCaseType.EquivalentStaticForceAnalysis
Equivalent static force analysis